In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1': [1,2,3,4],
                   'col2': [444,555,666,444],
                   'col3': ['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
#membatasi brp yg tampil
df.head(3)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [5]:
#menampilkan data yang unik atau data yang tidak sama 1 dengan yang lain
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
#menampilan brp bnyak data yg unik
df['col2'].nunique()

3

In [7]:
#menampilkan berapa bnyak data yang mengisi suatu value
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
#mengurutkan col2 dari yg terkecil sampai terbesar
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [10]:
#Pivot Table

In [11]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [12]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [13]:
#menampilkan pivot table dengan
#value adalah kolom D
#indexnya adalah kolom A dan B 
#kolomnya adalah C
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN